Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: The last element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最後の要素、またはpredicateを満たす要素が無いならばnil。

source: The last index where element is found.
ja: そこでelementが見つけられた最後のインデックス。

source: The least element in the vector.
ja: このベクターの中の最小の要素。

source: The least scalar in the vector.
ja: ベクターの中の最小のスカラー。

source: The list format style.
ja: リスト書式形式。

source: The literal 23 is inferred as an Int instance and then wrapped as an optional before the comparison is performed.
ja: リテラル23は、Intインスタンスと推論され、それから比較が実行される前にオプショナルとしてラップされます。

source: The little-endian representation of this integer.
ja: この整数のリトルエンディアン表現。

source: The lower bound for the range.
ja: 範囲の下側の境界。

source: The macro behaves just like the NS_SWIFT_UNAVAILABLE macro except that it doesn't support the customizable error message and it restricts compile-time access to the declaration in Objective-C code.
ja: このマクロはちょうどNS_SWIFT_UNAVAILABLEマクロのように振舞います、しかしそれがカスタマイズ可能なエラーメッセージをサポートしないことと、それがコンパイル時アクセスをObjective-Cコードの中の宣言に制限することを除きます。

source: The macro preserves the Objective-C name for use with Objective-C code, so the API has appropriate names in each language.
ja: このマクロは、Objective-C名をObjective-Cコードで使うために保護します、それでそのAPIは適切な名前を各言語において持ちます。

source: The magnitude of this value.
ja: この値の規模。

source: The mask type resulting from pointwise comparisons of this vector type.
ja: このベクター型のポイント単位比較からの結果のマスク型。

source: The masking addition assignment operator (&+=) silently wraps any overflow that occurs during the operation.
ja: マスク加算代入演算子（&+=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The masking multiplication assignment operator (&*=) silently wraps any overflow that occurs during the operation.
ja: マスク乗算代入演算子（&*=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The masking subtraction assignment operator (&-=) silently wraps any overflow that occurs during the operation.
ja: マスク減算代入演算子（&-=）は、演算の間に起こるあらゆるオーバーフローを黙ってラップします。

source: The maximum number of elements to return.
ja: 返される要素の最大限の数。

source: The maximum number of times to split the collection, or one less than the number of subsequences to return.
ja: コレクションを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum number of times to split the sequence, or one less than the number of subsequences to return.
ja: シーケンスを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum representable integer in this type.
ja: この型における最大の表現可能な整数。

source: The means of generating the subject’s ancestor representation.
ja: 主題のもつ先祖表現を生み出す手段。

source: The memory layout of a type, describing its size, stride, and alignment.
ja: ある型のメモリレイアウト、それはそれのサイズ、ストライド、およびアライメントを記述します。

source: The minimum number of Elements that must be able to be stored in the new buffer.
ja: 新しいバッファに格納されることが可能でなければならないElementの最小限の数。

source: The minimum number of elements that the newly created set should be able to store without reallocating its storage buffer.
ja: 新しく作成された集合がそれのストレージバッファをアロケートし直すことなしに格納できるであろう要素の最小の数。

source: The minimum representable integer in this type.
ja: この型における最小の表現可能な整数。

source: The most common way to iterate over the elements of a sequence is to use a for-in loop:
ja: シーケンスの要素のすべてにわたって反復するための最も一般的な方法は、for-inループを使うことです：

source: The most effective approach for migrating code to Swift is on a per-file basis—that is, one class at a time.
ja: スウィフトへの移っているコードのために最も効果的なアプローチは、ファイル毎原則の上にあります ― すなわち、一度にひとつのクラス。

source: The multiplication operator (*) calculates the product of its two arguments.
ja: 乗算演算子（*）は、それの２つの引数の積を計算します。

source: The negation operator (prefix -) returns the additive inverse of its argument.
ja: 負にする演算子（前置-）は、この引数の加法の逆元を返します。

source: The new element is inserted before the element currently at the specified index.
ja: 新しい要素は、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new element to insert into the collection.
ja: コレクションに挿入されることになる新しい要素。

source: The new elements are inserted before the element currently at the specified index.
ja: 新しいいくらかの要素が、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new elements to add to the collection.
ja: コレクションに加える新しいいくらかの要素。

source: The new elements to insert into the collection.
ja: コレクションへ挿入される新しいいくらかの要素。

source: The new name is shorter, but still understandable because it uses an industry-standard initialism for color components: RGBA.
ja: 新しい名前はより短いです、しかしまだ理解可能です、なぜならそれは色構成要素のための業界標準頭文字語：RGBAを使うからです。

source: The next element in the underlying sequence, if a next element exists; otherwise, nil.
ja: 次の要素が存在するならば、基礎をなすシーケンス中の次の要素；そうでなければ、nil。

source: The next example attempts to retrieve an index six positions from s.startIndex but fails, because that distance is beyond the index passed as limit.
ja: 次の例はs.startIndexから６位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The next example attempts to retrieve an index ten positions from numbers.startIndex, but fails, because that distance is beyond the index passed as limit.
ja: 次の例はnumbers.startIndexから10位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The next example creates a slice of numbers starting at index 2, and then uses the slice with relative(to:) to convert upToFour to a concrete range.
ja: 次の例は、numbersのスライスをインデックス2で開始して作成して、それからそのスライスをrelative(to:)と使うことでupToFourを具体的な範囲へ変換します。

source: The non-optional value is wrapped as an optional before the comparison is made.
ja: 非オプショナル値は、比較がなされる前にオプショナル値としてラップされます。

source: The number of bits equal to 1 in this value’s binary representation.
ja: この値のバイナリ表現の中の１に等しいビットの数。

source: The number of bits in the binary representation of this value.
ja: この値のバイナリ表現でのビット数。

source: The number of bits to shift lhs to the left.
ja: このビット数をlhsから左へとシフトします。

source: The number of bits to shift lhs to the right.
ja: このビット数をlhsから右へとシフトします。

source: The number of bits used for the underlying binary representation of values of this type.
ja: この型の値の基礎をなすバイナリ表現に対して使われるビットの数。

source: The number of bytes from the start of one instance of T to the start of the next when stored in contiguous memory or in an Array<T>.
ja: Tの１つのインスタンスの始まりから次のものの始まりまでのバイト数、隣接メモリの中にまたはArray<T>の中に格納される場合。

source: The number of colors that a traffic light uses isn't expected to grow, so it's not declared to be extensible.
ja: 信号機が使う色の数は増大は想定されません、それでそれは拡張可能に宣言されません。

source: The number of elements in the collection.
ja: コレクションの中の要素の数。

source: The number of elements in the set.
ja: 集合中の要素の数。

source: The number of elements in this collection.
ja: このコレクションの要素の数を返します。

source: The number of elements to drop from the beginning of the collection.
ja: コレクションの始まりから省く要素の数。

source: The number of elements to drop from the beginning of the sequence.
ja: このシーケンスの初めの部分から落とす要素の数。

source: The number of elements to drop off the end of the collection.
ja: コレクションの終わりで省く要素の数。

source: The number of elements to drop off the end of the sequence.
ja: シーケンスの末尾から取り除く要素の数。

source: The number of elements to remove from the collection.
ja: コレクションから削除される要素の数。

source: The number of elements to remove.
ja: 削除する要素の数を返します。

source: The number of leading zeros in this value’s binary representation.
ja: この値のバイナリ表現における先頭のゼロの数。

source: The number of new elements need not match the number of elements being removed.
ja: 新しい要素の数は、削除される要素の数と一致する必要はありません。

source: The number of scalars in the vector.
ja: ベクターの中のスカラーの数。

source: The number of scalars, or elements, in a vector of this type.
ja: この型のあるベクターの中のスカラーそれら、または要素それらの数。

source: The number of scalars, or elements, in the vector.
ja: ベクターの中のスカラー、または要素、の数。

source: The number of times to repeat the value passed in the repeating parameter.
ja: repeatingパラメータで渡された値を繰り返す回数。

source: The number of trailing zeros in this value’s binary representation.
ja: この値のバイナリ表現において後に続くゼロの数。

source: The object to encode.
ja: エンコードするオブジェクト。

source: The offset in bytes from a pointer to a value of type T to a pointer to the storage referenced by key, or nil if no such offset is available for the storage referenced by key.
ja: 型Tの値へのポインタから、keyによって参照されるストレージへのポインタまでのバイトでのオフセット、またはnil、もしそのようなオフセットがkeyによって参照されるストレージに利用可能でないならば。

source: The offset is available only if the given key refers to inline, directly addressable storage within the in-memory representation of T.
ja: このオフセットは与えられたキーがインラインの、直接にアドレス指定可能なストレージをTのインメモリ表現内で参照する場合にのみ利用可能です。

source: The operation doesn’t require going beyond the limiting numbers.endIndex value, so it succeeds.
ja: この操作は、限度であるnumbers.endIndex値を越えることを要求しません、それでそれは成功します。

source: The operation doesn’t require going beyond the limiting s.endIndex value, so it succeeds.
ja: 演算は、限界であるs.endIndex値を越えていく必要はありません、それでそれは成功します。

source: The optional publisher never produces errors.
ja: オプショナルパブリッシャーは、決してエラーを生み出しません。

source: The order in which A is printed relative to the other letters isn't guaranteed.
ja: Aが他の文字に関連して印字される順番は、保証されません。

source: The order of the key-value pairs is kept intact in the resulting KeyValuePairs instance.
ja: キー値ペアの順序は、結果のKeyValuePairsインスタンスにおいて損なわれず保たれます。

source: The order of the remaining elements is preserved.
ja: 残っている要素の順番は保全されます。

source: The ordering difference happens due to the way the now(_:) and later(_:) functions are defined.
ja: 順番の違いは、now(_:) and later(_:)関数が定義される方法のために起こります。

source: The other enumeration macros generate structures.
ja: 他の列挙マクロは、構造体を生成します。

source: The output to deliver to each subscriber.
ja: 各加入者に配達することになる出力。

source: The overflow addition operator (&+) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー加算演算子（&+）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The overflow multiplication operator (&*) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー乗算演算子（&*）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The overflow subtraction operator (&-) discards any bits that overflow the fixed width of the integer type.
ja: オーバーフロー減算演算子（&-）は、固定幅の整数型からオーバーフローするあらゆるビットを廃棄します。

source: The parameter indicates what a developer using Swift should do instead of using the part of the API you're making unavailable.
ja: そのパラメータは、あなたが利用できなくしているAPIの部分を使う代わりにSwiftを使う開発者がすべきは何かを指し示します。

source: The path of coding keys taken to get to this point in decoding.
ja: デコーディングのこの時点を得るために取られるコーディングキーのパス。

source: The path of coding keys taken to get to this point in encoding.
ja: エンコーディングのこの時点を得るために取られるコーディングキーのパス。

source: The pattern-matching operator is used internally in case statements for pattern matching.
ja: パターンマッチング演算子は、内部的にcase文の中でパターンマッチングのために使われます。

source: The payload for this option should always be { super.customMirror }:
ja: このオプションに対する積荷は、常に{ super.customMirror }であるべきです：

source: The performance of accessing endIndex depends on how many elements satisfy the predicate at the start of the collection, and might not offer the usual performance given by the Collection protocol.
ja: endIndexにアクセスする性能は、どのくらい多くの要素がこの述部をコレクションの始まりで満たすかに依存します、そしてCollectionプロトコルによって与えられる通常の性能を呈さないかもしれません。

source: The performance of accessing startIndex, first, any methods that depend on startIndex, or of advancing an index depends on how sparsely the filtering predicate is satisfied, and may not offer the usual performance given by Collection.
ja: startIndex, first、あらゆるstartIndex依存のメソッドでのアクセスにおける、またはあるインデックスを進んでいくことにおける性能は、どのくらいフィルタ述部が満たされるのがまばらかに依存します、そしてCollectionによって与えられる通常の性能を呈さないでしょう。

source: The performance of accessing startIndex, first, or any methods that depend on startIndex depends on how many elements satisfy the predicate at the start of the collection, and may not offer the usual performance given by the Collection protocol.
ja: startIndex、first、またはstartIndexに依存するあらゆるメソッドにアクセスする性能は、どのくらい多くの要素がその述部をコレクションの始まりで満たすかに依存します、そしてCollectionプロトコルによって与えられる通常の性能を呈さないかもしれません。

source: The pointwise wrapping product of two vectors.
ja: ポイント単位ラップの、２つのベクターの積。

source: The position after the element to create an index for.
ja: それに対するインデックスを作成する要素の後の位置。

source: The position after this position in the underlying collection.
ja: 基盤コレクションでのこの位置の後の位置。

source: The position at which to insert the new element.
ja: そこで新しい要素が挿入されることになる位置。

source: The position at which to insert the new elements.
ja: そこで新しいいくらかの要素が挿入されるところの位置。

source: The position of an element in a set.
ja: 集合の中でのある要素の位置。

source: The position of the element to access.
ja: アクセスする要素の位置。

source: The position of the element to remove.
ja: 削除する要素の位置。

source: The position of the first element in a non-empty collection.
ja: 空でないコレクションにおける最初の要素の位置。

source: The position of the first element in a nonempty collection.
ja: 空でないコレクションの中の最初の要素の位置。

source: The predicate must be a equivalence relation over the elements.
ja: 述部は要素に対して同値関係でなければなりません。

source: The predicate must be a strict weak ordering over the elements.
ja: 述部は、それら要素に対して厳密弱順序でなければなりません。

source: The predicate orders errors before successes and sorts the error responses by their error code.
ja: この述部はエラーを成功の前に並べて、そしてそれらエラー応答をそのエラーコードによってソートします。

source: The preferred display style for the mirror when presented in the debugger or in a playground.
ja: デバッガにまたはプレイグラウンドに含まれる時のミラーのための優先表示形式。

source: The presence of a value, stored as Wrapped.
ja: ある値の存在、Wrappedとして格納されます。

source: The product of x and y is 2000, which is too large to represent in a UInt8 instance.
ja: xとyの積は2000です、それはUInt8インスタンスにおいて表すには大きすぎます。

source: The product of x and y is -1920, which is too large to represent in an Int8 instance.
ja: xとyの積は-1920です、それはInt8インスタンスにおいて表すには大きすぎます。

source: The product of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の積は、引数の持つ型において表現可能でなければなりません。

source: The property defined by the new declaration is easier to use in Swift.
ja: 新しい宣言によって宣言されるこのプロパティは、Swiftで使うのがより簡単です。

source: The radix, or base, to use for converting text to an integer value.
ja: textを整数値に変換するのに使うための基数、または底。

source: The random number generator to use when choosing a random element.
ja: ある無作為な要素を選ぶときに使う無作為数生成子。

source: The random number generator to use when creating the new random value.
ja: 新しい無作為値を作成するときに使う無作為数生成子。

source: The random number generator to use when shuffling the collection.
ja: コレクションをシャッフルするときに使う無作為数生成子。

source: The random number generator to use when shuffling the sequence.
ja: シーケンスをシャッフルするときに使う無作為数生成子。

source: The range expression is converted to a concrete subrange relative to this collection.
ja: 範囲式は、このコレクションに関連するある具体的な下位範囲へ変換されます。

source: The range in which to create a random value.
ja: その中においてある無作為な値が作成される範囲。

source: The range of the collection to be removed.
ja: 削除されることになるコレクションの範囲。

source: The range to clamp the bounds of this range.
ja: この範囲に制限を課すための範囲。

source: The range’s lower bound.
ja: その範囲の下方の境界。

source: The range’s upper bound.
ja: その範囲の上方の境界。

source: The raw type that can be used to represent all values of the conforming type.
ja: 準拠している型のすべての値を表すために使われる生の型。

source: The raw value must therefore be of a type that conforms to the FixedWidthInteger protocol, such as UInt8 or Int.
ja: 生の値はしたがって、FixedWidthIntegerプロトコルに準拠する型、例えばUInt8またはIntなどのものでなければなりません。

source: The raw value of the allowedMoves instance is the result of the bitwise OR of its three members’ raw values:
ja: allowedMovesインスタンスの生の値は、それの３つのメンバの持つ生の値のビット単位ORの結果です：

source: The raw value of the option set to create.
ja: 作成されるオプションセットの生の値。

source: The raw value to use for the new instance.
ja: 新しいインスタンスのために使う生の値。

source: The remainder of the relational operator functions are implemented by the standard library for any type that conforms to Comparable.
ja: 残りの関係演算子関数は、Comparableに準拠するあらゆる型に対して標準ライブラリによって実装されます。

source: The removed element.
ja: 削除された要素。

source: The representation to use for ancestor classes.
ja: 先祖クラスに対して使う表現

source: The requested number of elements to store.
ja: 依頼された格納される要素数。

source: The result begins with the first element of numbers that does not satisfy predicate.
ja: 結果は、predicateを満たさない、numbersの最初の要素で始まります。

source: The result can be negative only if the collection conforms to the BidirectionalCollection protocol.
ja: 結果は、そのコレクションがBidirectionalCollectionプロトコルに準拠する場合に限り、負であることができます。

source: The result does not include any dynamically allocated or out of line storage.
ja: 結果は、あらゆる動的にアロケートされるおよびアウトオブラインのストレージを含みません。

source: The result has the same sign as lhs and has a magnitude less than rhs.magnitude.
ja: 結果は、lhsと同じ符号を持ち、rhs.magnitudeより小さい規模を持ちます。

source: The result is nil if from is nil.
ja: 結果は、fromがnilならば、nilです。

source: The result is always positive.
ja: 結果は常に正です。

source: The result of the given closure.
ja: 与えられたクロージャの結果

source: The result of the remainder operator (%) has the same sign as lhs and has a magnitude less than rhs.magnitude.
ja: 剰余演算子（%）の結果は、lhsと同じ符号を持ち、rhs.magnitudeより小さい規模を持ちます。

source: The result to deliver to each subscriber.
ja: 各加入者に配達する結果。

source: The resulting LazyScanSequence is itself lazy, too, so further sequence operations also defer computation.
ja: 結果のLazyScanSequenceはそれ自体また遅延です、なのでその先のシーケンス演算もまた計算を延期します。

source: The resulting array consists of at most maxSplits + 1 subsequences.
ja: 結果の配列は、多くともmaxSplits + 1の下位シーケンスから成ります。

source: The resulting collection has the type of argument on the right-hand side.
ja: 結果となるコレクションは、右手側の引数の型を持ちます。

source: The resulting collection has the type of the argument on the left-hand side.
ja: 結果となるコレクションは、左手側の引数の型を持ちます。

source: The resulting flattened array.
ja: 結果として生じる平たくされた配列。

source: The resulting instance may not have the same numeric value as bitPattern—it is only guaranteed to use the same pattern of bits in its binary representation.
ja: 結果のインスタンスは、bitPatternと同じ数値を持たないかもしれません — それは、同じパターンのビットをそれのバイナリ表現において使うことを保証されるだけです。

source: The resulting quotient must be representable within the bounds of the type.
ja: 結果の商は、この型の境界の内に表現可能でなければなりません。

source: The resulting subsequence does not include the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みません。

source: The resulting subsequence includes the element at the position end.
ja: 結果となるシーケンスは、位置endでの要素を含みます。

source: The resulting value must be representable in the same type as the argument.
ja: 結果の値は、引数と同じ型で表現可能でなければなりません。

source: The resulting value must be representable within the value’s type.
ja: 結果の値は、その値の持つ型の内部に表現可能でなければなりません。

source: The return type of functions that do not return normally, that is, a type with no values.
ja: 普通に戻らない関数の戻り型、すなわち、値なしでの型。

source: The return types of the two methods are annotated as nullable, because the methods return nil if the list doesn't contain the given list item or name.
ja: ２つのメソッドの戻り型はnullableとして注釈を付けられます、なぜならこれらメソッドはnilを、そのリストが与えられたリスト項目または名前を含まないならば返すからです。

source: The returned range is not guaranteed to be inside the bounds of collection.
ja: 返される範囲は、collectionの境界内であると保証されません。

source: The round rule to use when converting elements of other. The default is .towardZero.
ja: otherの要素を変換する時に使う丸め規則。省略時は.towardZeroです。

source: The second element of the vector.
ja: ベクターの２番目の要素。

source: The second example passes 1 for the maxSplits parameter, so the original string is split just once, into two new strings.
ja: ２番目の例は1をmaxSplitsパラメータに渡します、それで元の文字列は一度だけ分割されて、２つの新しい文字列になります。

source: The second partition, numbers[p...], is made up of the elements that are greater than 30.
ja: ２番目の区画、numbers[p...]は、30より大きなものである要素から構成されます。

source: The second value to add.
ja: 加算する第２の値。

source: The second value to multiply.
ja: 掛け合わされる第２の値。

source: The sequence must be finite.
ja: シーケンスは有限でなければなりません。

source: The sequence of elements for the new collection.
ja: 新しいコレクションのための要素からなるシーケンス。

source: The sequence’s iterator is used directly to retrieve the initial value before looping over the rest of the sequence.
ja: シーケンスのもつイテレータが直に使われて、残りのシーケンスにループする前に初期値をとってきます。

source: The sequence’s maximum element if the sequence is not empty; otherwise, nil.
ja: シーケンスが空でないならばシーケンスの最大の要素；そうでなければnil。

source: The sequence’s maximum element.
ja: シーケンスの最大の要素。

source: The sequence’s minimum element, according to areInIncreasingOrder.
ja: シーケンスの最小の要素、areInIncreasingOrderによる。

source: The sequence’s minimum element.
ja: シーケンスの最小の要素。

source: The set must not be empty.
ja: 集合は空であってはなりません。

source: The shared actor instance that will be used to provide mutually-exclusive access to declarations annotated with the given global actor type.
ja: 共有アクターインスタンス、それは与えられたグローバルアクター型で注釈を付けられた宣言への相互排他アクセスを提供するために使われます。

source: The shared executor instance that will be used to provide mutually-exclusive access for the global actor.
ja: 共有エグゼキュータ（遂行者）インスタンス、それはグローバルアクターに対する相互排他アクセスを提供するために使われます。

source: The shift is performed using this masked value.
ja: シフトは、このマスクされた値を使って実行されます。

source: The shortened form is preferred for ease of reading and writing code.
ja: この短縮された形式は、コードの読み書きの容易さのためにより好ましいものです。

source: The sign of this number, expressed as an integer of the same type.
ja: この数の符号、同じ型の整数として表されます。

source: The size, in bytes, of the given value’s type.
ja: 与えられた値の持つ型の、バイトでの、大きさ。

source: The size, stride, and alignment of the Point type are accessible as static properties of MemoryLayout<Point>.
ja: Point型のサイズ、ストライド、そしてアライメントは、MemoryLayout<Point>の静的プロパティとしてアクセス可能です。

source: The sorting algorithm is not guaranteed to be stable.
ja: このソートアルゴリズムは、安定であることを保証されません。

source: The stable identity of the entity associated with this instance.
ja: このインスタンスと結び付けられた登録項目の安定した同一性。

source: The starting position for iterating members of the set.
ja: 集合のメンバを反復するための開始位置。

source: The static members nextDay, secondDay, priority, and standard are unique, individual options.
ja: 静的メンバnextDay, secondDay、priority、そしてstandardは特有で、別個のオプションです。

source: The static type of the subject being reflected.
ja: リフレクションされている主題の静的型。

source: The stored Header instance.
ja: 格納されたHeaderインスタンス。

source: The stride, in bytes, of the given value’s type.
ja: 与えられた値の持つ型の、バイトでの、ストライド。

source: The string passed as description may begin with a plus or minus sign character (+ or -), followed by one or more numeric digits (0-9).
ja: descriptionとして渡される文字列は、プラスまたはマイナス符号文字（+または-）で始まり、１つ以上の数値のアラビア数字（0-9）が続くことがあります。

source: The string passed as text may begin with a plus or minus sign character (+ or -), followed by one or more numeric digits (0-9) or letters (a-z or A-Z).
ja: textとして渡される文字列は、プラスまたはマイナス符号文字（+または-）で始まり、１つ以上の数値のアラビア数字（0-9）または文字（a-z or A-Z）が続くことがあります。

source: The structure to use for the mirror.
ja: ミラーのために使う構造体。

source: The subrange of the collection to remove.
ja: 削除することになるコレクションの下位範囲。

source: The subrange of the collection to replace.
ja: 置き換えることになるコレクションの下位範囲。

source: The subscriber to add.
ja: 加えることになる加入者。

source: The subscriber to attach to this Publisher, after which it can receive values.
ja: このPublisherに添付することになる加入者、それの後にそれは値を受け取ることができます。

source: The subscript notation is preferred over prefix(through:).
ja: 添え字表記法は、prefix(through:)よりも好まれます。

source: The subscript notation is preferred over suffix(from:).
ja: 添え字表記法は、suffix(from:)よりも好まれます。

source: The subscript notation is preferred over prefix(upTo:).
ja: 添え字表記法は、prefix(upTo:)よりも好まれます。

source: The subtraction operator (-) calculates the difference of its two arguments.
ja: 減算演算子（-）は、それの２つの引数の差を計算します。

source: The success value, if the instance represents a success.
ja: 成功値、もしインスタンスが成功を表すならば。

source: The successor of an index must be well defined.
ja: あるインデックスの後に続くものは、よく定義されなければなりません。

source: The sum of the scalars in the vector.
ja: ベクターの中のスカラーそれらの合計。

source: The sum of the two arguments must be representable in the arguments’ type.
ja: ２つの引数の合計は、引数の持つ型において表現可能でなければなりません。

source: The sum of types that can be used as a Quick Look representation.
ja: 「クイックルック」表現として使われることのできる型の総和。

source: The system’s default source of random data.
ja: システムの持つ省略時の無作為データのソース。

source: The third element of the vector.
ja: ベクターの３番目の要素。
